#!/usr/bin/python2.6
# -*- coding: utf-8 -*-
def ChooseZi():
    line1 = ''
#    ZiStr = '日月天地一'
    ZiList = ['一', '二', '三', '人', '个',
              '大', '山', '上', '下', '小',
              '雨', '天', '车', '开', '火',
              '门', '口', '月', '羊', '只',
              '有', '牛', '水', '中', '风',
              '头', '田', '土', '里', '在',
              '王', '子', '儿', '女', '刀',
              '木', '鸟', '伞', '鱼', '瓜',
              '气', '飞', '虫', '米', '云',
              '电', '石', '了', '来', '玉',
              '去', '回', '多', '少', '问',
              '早', '巴', '父', '工', '力',
              '不', '干', '几', '男', '坐',
              '打', '四', '五', '六', '闪',
              '的', '花', '朵', '果', '比',]
#    ZiList = list(ZiStr)
    import random
    result = random.sample(ZiList, 20)
    print result
    for line in result:
        line1 += line
    return line1